---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPattern.Length
zh: 长度
source: html/cf31fd06-b2a9-0bcc-24ea-7d8fb273bec4.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.Length Property

**中文**: 长度

The length of the main baluster pattern.

## Syntax (C#)
```csharp
public double Length { get; }
```